//ДЗ семинар 3
function greeting(username) {
    if (username !== null && username.trim() !== "" && username.match(/[a-zA-Zа-яА-ЯЁё '-]+/)) {
        console.log("Привет, " + username + "!");
    } else {
        console.log("Пожалуйста, введите корректное имя, оно не должно содержать цифр или быть пустым.");
    }
}

const username = prompt("Здравствуйте, введите свое имя:");
greeting(username);

//trim() функция использована для удаления лишних пробелов в начале и конце введенного имени.
// match() с регулярным выражением /[a-zA-Zа-яА-ЯЁё '-]+/ - функция использована, 
//чтобы проверить имя на наличие только букв, апострофов, пробелов и дефисов.
