// Необходимо создать html-страницу с названием index.html, в которой подключить файл main.js (его тоже необходимо создать рядом с html-файлом). 
//В js-файле необходимо создать следующий скрипт:
// Cоздать функцию greeting, которая принимает в качестве параметра имя человека и выводит приветствие, используя переданное ей имя, в консоль.
// Необходимо продемонстрировать работу функции: у пользователя запросить его имя и вызвать функцию greeting, передав туда полученное от пользователя значение.

function greeting(username) {
    if (username !== null && username.trim() !== "" && username.match(/[a-zA-Zа-яА-ЯЁё '-]+/)) {
        console.log("Привет, " + username + "!");
    } else {
        console.log("Пожалуйста, введите корректное имя, оно не должно содержать цифр или быть пустым.");
    }
}

const username = prompt("Здравствуйте, введите свое имя:");
greeting(username);

//trim() функция использована для удаления лишних пробелов в начале и конце введенного имени.
// match() с регулярным выражением /[a-zA-Zа-яА-ЯЁё '-]+/ - функция использована, 
//чтобы проверить имя на наличие только букв, апострофов, пробелов и дефисов.
